Public Member Functions | Protected Member Functions | Friends | List of all members
ACAPI::Element::ModifiableOpeningGeometry Class Referencefinal
Element Manager
#include <OpeningGeometry.hpp>
 Inheritance diagram for ACAPI::Element::ModifiableOpeningGeometry:
 Public Member Functions
void  | SetPolygon (const Geometry::Polygon2D &polygon)
Sets the shape of the opening.
Result< void >  | Transform (const API_Tranmat &transformation)
Moves and rotates the opening.
 Public Member Functions inherited from ACAPI::Element::OpeningGeometry
std::optional< Geometry::Polygon2D >  | GetPolygon () const
API_Coord3D  | GetAnchorPoint () const
API_Vector3D  | GetVectorX () const
API_Vector3D  | GetVectorY () const
API_Vector3D  | GetExtrusionDirection () const
 Public Member Functions inherited from ACAPI::Object
Object (std::shared_ptr< Impl::ObjectImpl > impl)
Constructs a new object.
const API_Token &  | GetToken () const
Get the token for this object.
 Protected Member Functions
ModifiableOpeningGeometry (std::shared_ptr< Impl::OpeningGeometryImpl > impl)
Constructs a ModifiableOpeningGeometry with an OpeningGeometry implementation.
 Protected Member Functions inherited from ACAPI::Element::OpeningGeometry
OpeningGeometry (std::shared_ptr< Impl::OpeningGeometryImpl > impl)
Constructs an OpeningGeometry with an OpeningGeometry implementation.
 Protected Member Functions inherited from ACAPI::Object
~Object ()
Default destructor.
 Friends
 class  | Opening
 Additional Inherited Members
 Protected Attributes inherited from ACAPI::Object
 std::shared_ptr< Impl::ObjectImpl >  | mImpl
Impl object given by constructor.
Detailed Description
It represents the modifiable polygon and place of an Opening element.
Since
Archicad 29
Constructor & Destructor Documentation
◆ ModifiableOpeningGeometry()
 ACAPI::Element::ModifiableOpeningGeometry::ModifiableOpeningGeometry  |  ( |  std::shared_ptr< Impl::OpeningGeometryImpl > |  impl | )
protected
Constructs a ModifiableOpeningGeometry with an OpeningGeometry implementation.
Parameters
impl | The OpeningGeometry implementation.
Member Function Documentation
◆ SetPolygon()
 void ACAPI::Element::ModifiableOpeningGeometry::SetPolygon  |  ( |  const Geometry::Polygon2D & |  polygon | )
Sets the shape of the opening.
Parameters
polygon | The new custom polygon that will be set as the openings shape.
◆ Transform()
 Result< void > ACAPI::Element::ModifiableOpeningGeometry::Transform  |  ( |  const API_Tranmat & |  transformation | )
Moves and rotates the opening.
Parameters
transformation | The matrix of the transformation. Must contain an ortogonal matrix with no scaling.
Returns
Returns error in case of bad parameters.